Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--openlayers_quickstart.tmx
Source language: en
Languages: ja

source: OpenLayers Quickstart
ja: OpenLayersクイックスタート

source: This Quick Start describes some basic steps required to start working with OpenLayers: creating a basic map, adding raster and vector layers and styling features.
ja: このクイックスタートでは、OpenLayersをはじめて使うときの基本的な手順について説明します。基本的なマップの作成、ラスタレイヤとベクタレイヤの追加、地物のスタイリングです。

source: OpenLayers makes it easy to put a dynamic map in any web page. It can display map tiles, vector data and markers loaded from any source. OpenLayers has been developed to further the use of geographic information of all kinds. It is completely free, Open Source JavaScript, released under the 2-clause BSD License (also known as the FreeBSD).
ja: OpenLayersを使用すると、任意のWebページに動的な地図を簡単に配置できます。任意のソースから地図タイル、ベクタデータやマーカーをロードして表示可能です。OpenLayers はすべての種類の地理情報のさらなる利用のために開発されてきました。完全にフリーなオープンソース JavaScript で、2条項 BSD ライセンス (FreeBSD ライセンスとしても知られています) でリリースされています。

source: Core concepts
ja: 主な概念

source: Before we start working with OpenLayers it helps to understand OpenLayers core concepts:
ja: OpenLayersで作業を始める前に、OpenLayersの主な概念を理解しておくとよいでしょう。

source: **Map**
ja: **マップ**

source: The *map* is the core component of OpenLayers. For a *map* to render, a *view*, one or more *layers*, and a target container are needed.
ja: *マップ*はOpenLayersの主要な要素です。*マップ*をレンダリングするには、*ビュー*、1つまたは複数の*レイヤ*、およびターゲットコンテナが必要です。

source: **View**
ja: **ビュー**

source: The *view* determines how the map is rendered. It is used to set the resolution, the center location, etc. It is like a camera through which we look at the map's content.
ja: *ビュー*はmapのレンダリング方法を決定します。解像度や中心位置などを設定します。これはマップの内容を見るためのカメラのようなものです。

source: **Layers**
ja: **レイヤ**

source: *Layers* can be added to the map in a stacked order. Layers can be either *raster layers* (images), or *vector layers* (points/lines/polygons).
ja: *レイヤ*はスタック順にマップに追加できます。レイヤは、*ラスタレイヤ*(イメージ)または*ベクタレイヤ*(点/線分/ポリゴン)のいずれかです。

source: **Source**
ja: **ソース**

source: Each layer has a *source*, which knows how to load the layer content. In the case of *vector layers*, its source reads vector data using a *format* class (for example GeoJSON or KML) and provides the layer with a set of *features*.
ja: 各レイヤには、レイヤコンテンツのロード方法を知っている*ソース*があります。*ベクタレイヤ*の場合、そのソースは*フォーマット*クラス(例えばGeoJSONやKML)を使ってベクタデータを読み込み、一連の*フィーチャー*をレイヤに提供します。

source: **Features**
ja: **フィーチャー**

source: *Features* represent real world things and can be rendered using different *geometries* (like point, line or polygon) using a given *style*, which determines its look (line thinkness, fill color, etc).
ja: *フィーチャー*は現実世界のものを表し、特定の*スタイル*を使用して、さまざまな*ジオメトリ*(点、線、ポリゴンなど)を使用してレンダリングできます。これにより、外観(線の思考、塗り潰し色など)が決まります。

source: Create a basic map
ja: 基本マップを作成する

source: Create a file in e.g. /home/user/ called basic-map.html , and copy the following content into the file.
ja: /home/user/でbasic-map.htmlという名前のファイルを作成して、次の内容を記入します。

source: Now try opening basic-map.html from a web browser using File->Open File. You should see the following:
ja: Webブラウザから[ファイル]->[ファイルを開く]を使用して、basic-map.htmlを開いてみます。次のように表示されるはずです。

source: Note:
ja: 注意：

source: The code follows the best practice of loading JavaScipt code at the end of the html file.
ja: このコードは、JavaSciptコードをhtmlファイルの最後にロードするというベスト・プラクティスに従います。

source: An OpenLayers map needs to be attached to a HTML DOM element, so we have created a ``<div>`` element identified by the *map* id.
ja: OpenLayersマップはHTML DOM要素にアタッチする必要があるため、*map*idで識別される``<div>``要素を作成しました。

source: Maps are represented by the ``ol.Map`` class. We specify the DOM element to render the map into using the **target** property.
ja: マップは``ol.Map``クラスで表されます。**target**プロパティーを使用して、マップをレンダリングするDOM要素を指定します。

source: OpenLayers allows map rendering using two different mechanisms: Canvas and WebGL. The default renderer is *canvas*.
ja: OpenLayersでは、キャンバスとWebGLという2つの異なるメカニズムを使用したマップレンダリングが可能です。既定のレンダラーは*canvas*です。

source: A map shows data contained within layers, so we have created a tiled layer, represented by the ``ol.layer.Tile`` class, that loads content from the OpenStreetMap project, using the ``ol.source.OSM`` source class.
ja: レイヤ内にマップのデータを表示するため、``ol.source.OSM``ソースクラスを使用してOpenStreetMapプロジェクトからコンテンツをロードするようにしたタイルレイヤの``ol.layer.Tile``クラスを作成しました。

source: Finally, we set the initial position of the *camera* using the ``ol.View`` class, set the initial zoom level and center location.
ja: 最後に、``ol.View``クラスを使用して*camera*の初期位置を設定し、初期ズームレベルと中心位置を設定します。

source: Add raster layers
ja: ラスタレイヤ追加する

source: The most used raster layers are the tiled layers, provided by the likes of OpenStreetMap, Stamen, Bing, etc. Tiled layers are represented by the ``ol.layer.Tile`` class and must use a source that knows how to load tiles from a given provider, like ``ol.source.OSM`` or ``ol.source.Stamen``:
ja: OpenStreetMap、Stamen、Bingなどによって提供されるタイルレイヤが、最も使用されるラスタレイヤです。タイルレイヤーは``ol.layer.Tile``クラスで表され、``ol.source.OSM``または``ol.source.Stamen``のように、特定のプロバイダからタイルをロードする方法を知っているソースを使用する必要があります。

source: Layers can be added to the map in two ways:
ja: レイヤは、次の2つの方法でマップに追加できます。

source: When constructing the ``ol.Map``, use the ``layers`` property:
ja: ``ol.Map``を作成する場合は、``layers``プロパティを使用します。

source: Add them manually with the ``map.addLayer()`` method:
ja: ``map.addLayer()``メソッドを使って手動で追加します。

source: Add vector layers
ja: ベクタレイヤを追加する

source: Vector layers are represented by the ``ol.layer.Vector`` class and must use a source suitable for reading the vector format, like ``ol.source.GeoJSON``, ``ol.source.KML`` or ``ol.source.TopoJSON``.
ja: ベクタレイヤは``ol.layer.Vector``クラスで表され、``ol.source.GeoJSON``、``ol.source.KML``、``ol.source.TopoJSON``など、ベクタフォーマットの読み込みに適したソースを使用する必要があります。

source: Note, in the previous code we must change the ``url_to_file`` to point to a valid GeoJSON file placed in our server.
ja: 前のコードでは、サーバに置かれた有効なGeoJSONファイルを指すように``url_to_file``を変更する必要があることに注意してください。Javascriptセキュリティでは、異なるドメイン/ポート上の外部URLからデータセットを取得することができないことに注意してください。(aka.

source: Note that Javascript security will prevent sourcing of datasets from an external URL on a different domain / port (a.k.a. same-origin policy).
ja: 同一発信元ポリシー)。

source: Features can also be created manually. In this case we need to create a geometry that represents the feature:
ja: フィーチャーは手動で作成することもできます。この場合、フィーチャーを表すジオメトリを作成する必要があります。

source: Apply style to features
ja: フィーチャにスタイルを適用する

source: Features within vector layers can be styled. The style is determined by a combination of fill, stroke, text and image, which are all optional. In addition, a style can be applied to a layer, which determines the style of all contained features, or to an individual feature.
ja: ベクタレイヤ内のフィーチャにスタイルを設定できます。スタイルは、塗り、線、テキスト、イメージの組み合わせによって決まります。これらはすべて任意の設定項目です。さらに、レイヤにスタイルを適用して、含まれているすべてのフィーチャのスタイルを決定したり、個々のフィーチャにスタイルを適用することもできます。

source: A style is represented by the ``ol.style.Style`` class which has properties to set the ``fill``, ``stroke``, ``text`` and ``image`` to be applied. The next example shows the World's administrative limits dataset styled to use a green fill and stroke:
ja: スタイルは、``ol.style.Style``クラスによって表され、このクラスは、適用される``fill``、``stroke``、``text``および``image``を設定するプロパティを有する。次の例は、緑の塗りと線を使用するようにスタイル設定された世界の行政区界データセットを示しています。

source: In the code, we have loaded a TopoJSON file and styled it through the ``style`` property. We have set a ``fill`` and ``stroke``, required for lines and polygons, and an ``image`` (in this case a circle) used for point features.
ja: このコードでは、TopoJSONファイルをロードし、``style``プロパティーを使ってスタイルを設定しています。ラインとポリゴンに必要な``fill``と``stroke``、およびポイントフィーチャに使用する``image``(この場合は円)を設定しました。

source: Work with events
ja: イベントの操作

source: Most of the components, like map, layers or controls, trigger events to notify changes. For example we can be notified each time the mouse is moved over the map, or when a feature is added to a vector layer, etc.
ja: ほとんどの(マップ、レイヤ、コントロールなどの)要素は、イベントをトリガして変更を通知します。たとえば、マウスがマップ上を移動するたびに通知されたり、フィーチャがベクタレイヤに追加されるたびに通知されたりします。

source: Events can be easily registered on an object with the ``on()`` method and unregistered with ``un()``.
ja: イベントは``on()``メソッドでオブジェクトに簡単に登録でき、``un()``で登録解除できます。

source: The following code registers an event on a map instance, and will be notified each time the pointer is moved. Within the callback function we obtain the pointer coordinates and print in the browser console in two different projections.
ja: 次のコードでは、マップのインスタンスにイベントを登録し、ポインタが移動するたびに通知されます。コールバック関数内では、ポインタの座標を取得し、ブラウザコンソールに2つの異なる投影法で出力します。

source: What next?
ja: 次のステップ

source: Sometimes the quickest way to work out how OpenLayers works is to look at examples and their source code. You can find more OpenLayers information here:
ja: OpenLayersの動作を理解するための最も簡単な方法は、サンプルとそのソースコードを調べることです。OpenLayersの詳細については、以下を参照してください。

source: `API Docs <../../openlayers/apidoc/>`_
ja: `APIドキュメント <../../openlayers/apidoc/>`_

source: `Examples <../../openlayers/examples/>`_
ja: `例 <../../openlayers/examples/>`_

source: `OpenLayers.org Website <https://openlayers.org/>`_
ja: `OpenLayers.org Webサイト <https://openlayers.org/>`_
